vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1061X_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="software_rng_adapter" Cversion="1.0.0" condition="device.MIMXRT1061X_AND_driver.common">
      <description>Component software_rng_adapter; {for-development:SDK-Manifest-ID: component.software_rng_adapter.MIMXRT1061X}</description>
      <files>
        <file category="header" name="components/rng/fsl_adapter_rng.h"/>
        <file category="sourceC" name="components/rng/fsl_adapter_software_rng.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="timer_manager" Cversion="1.0.0" condition="device.MIMXRT1061X_AND__component.gpt_adapter_OR_component.pit_adapter__AND_component.lists_AND_driver.common">
      <description>Component timer_manager; {for-development:SDK-Manifest-ID: component.timer_manager.MIMXRT1061X}</description>
      <files>
        <file category="header" name="components/timer_manager/fsl_component_timer_manager.h"/>
        <file category="sourceC" name="components/timer_manager/fsl_component_timer_manager.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="trng_adapter" Cversion="1.0.0" condition="device.MIMXRT1061X_AND_driver.common_AND_driver.trng">
      <description>Component trng_adapter; {for-development:SDK-Manifest-ID: component.trng_adapter.MIMXRT1061X}</description>
      <files>
        <file category="header" name="components/rng/fsl_adapter_rng.h"/>
        <file category="sourceC" name="components/rng/fsl_adapter_trng.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="MIMXRT1061X_header" Cversion="1.0.0" condition="device.MIMXRT1061X_AND_CMSIS_Include_core_cm">
      <description>Device MIMXRT1061X_cmsis; {for-development:SDK-Manifest-ID: device.MIMXRT1061X_CMSIS.MIMXRT1061X}</description>
      <files>
        <file category="header" name="fsl_device_registers.h"/>
        <file category="header" name="MIMXRT1061X.h"/>
        <file category="header" name="MIMXRT1061X_features.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.1.0" condition="device.MIMXRT1061X_AND__armclang_OR_iar__AND_device.MIMXRT1061X_system">
      <description>Device MIMXRT1061X_startup; {for-development:SDK-Manifest-ID: device.MIMXRT1061X_startup.MIMXRT1061X}</description>
      <files>
        <file condition="iar" category="sourceAsm" attr="config" name="iar/startup_MIMXRT1061X.s" version="1.1.0"/>
        <file condition="mdk" category="sourceAsm" attr="config" name="arm/startup_MIMXRT1061X.S" version="1.1.0"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MIMXRT1061Xxxxxx_flexspi_nor.scf" version="1.1.0"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MIMXRT1061Xxxxxx_flexspi_nor_sdram.scf" version="1.1.0"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MIMXRT1061Xxxxxx_ram.scf" version="1.1.0"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MIMXRT1061Xxxxxx_sdram.scf" version="1.1.0"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MIMXRT1061Xxxxxx_sdram_txt.scf" version="1.1.0"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MIMXRT1061Xxxxxx_flexspi_nor.icf" version="1.1.0"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MIMXRT1061Xxxxxx_flexspi_nor_sdram.icf" version="1.1.0"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MIMXRT1061Xxxxxx_ram.icf" version="1.1.0"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MIMXRT1061Xxxxxx_sdram.icf" version="1.1.0"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MIMXRT1061Xxxxxx_sdram_txt.icf" version="1.1.0"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="MIMXRT1061X_system" Cversion="1.0.0" condition="device.MIMXRT1061X_AND_device.MIMXRT1061X_CMSIS">
      <description>Device MIMXRT1061X_system; {for-development:SDK-Manifest-ID: device.MIMXRT1061X_system.MIMXRT1061X}</description>
      <files>
        <file category="sourceC" name="system_MIMXRT1061X.c"/>
        <file category="header" name="system_MIMXRT1061X.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="adc_12b1msps_sar" Cversion="2.0.4" condition="device.MIMXRT1061X_AND_driver.common">
      <description>ADC Driver; {for-development:SDK-Manifest-ID: platform.drivers.adc_12b1msps_sar.MIMXRT1061X}</description>
      <files>
        <file category="sourceC" name="drivers/fsl_adc.c"/>
        <file category="header" name="drivers/fsl_adc.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="adc_etc" Cversion="2.2.1" condition="device.MIMXRT1061X_AND_driver.common">
      <description>ADC_ETC Driver; {for-development:SDK-Manifest-ID: platform.drivers.adc_etc.MIMXRT1061X}</description>
      <files>
        <file category="sourceC" name="drivers/fsl_adc_etc.c"/>
        <file category="header" name="drivers/fsl_adc_etc.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="aipstz" Cversion="2.0.1" condition="device.MIMXRT1061X_AND_driver.common">
      <description>aipstz Driver; {for-development:SDK-Manifest-ID: platform.drivers.aipstz.MIMXRT1061X}</description>
      <files>
        <file category="sourceC" name="drivers/fsl_aipstz.c"/>
        <file category="header" name="drivers/fsl_aipstz.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="aoi" Cversion="2.0.1" condition="device.MIMXRT1061X_AND_driver.common">
      <description>AOI Driver; {for-development:SDK-Manifest-ID: platform.drivers.aoi.MIMXRT1061X}</description>
      <files>
        <file category="header" name="drivers/fsl_aoi.h"/>
        <file category="sourceC" name="drivers/fsl_aoi.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="bee" Cversion="2.0.2" condition="device.MIMXRT1061X_AND_driver.common">
      <description>BEE Driver; {for-development:SDK-Manifest-ID: platform.drivers.bee.MIMXRT1061X}</description>
      <files>
        <file category="sourceC" name="drivers/fsl_bee.c"/>
        <file category="header" name="drivers/fsl_bee.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cache" Cversion="2.0.4" condition="device.MIMXRT1061X_AND_driver.common">
      <description>CACHE Driver; {for-development:SDK-Manifest-ID: platform.drivers.cache_armv7_m7.MIMXRT1061X}</description>
      <files>
        <file category="sourceC" name="drivers/fsl_cache.c"/>
        <file category="header" name="drivers/fsl_cache.h"/>
      </files>
    </component>
