vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1061X_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexspi" Cversion="2.3.5" condition="device.MIMXRT1061X_AND_driver.common">
      <description>FLEXSPI Driver; {for-development:SDK-Manifest-ID: platform.drivers.flexspi.MIMXRT1061X}</description>
      <files>
        <file category="sourceC" name="drivers/fsl_flexspi.c"/>
        <file category="header" name="drivers/fsl_flexspi.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="gpc" Cversion="2.1.1" condition="device.MIMXRT1061X_AND_driver.common">
      <description>GPC Driver; {for-development:SDK-Manifest-ID: platform.drivers.gpc_1.MIMXRT1061X}</description>
      <files>
        <file category="sourceC" name="drivers/fsl_gpc.c"/>
        <file category="header" name="drivers/fsl_gpc.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="gpt" Cversion="2.0.3" condition="device.MIMXRT1061X_AND_driver.common">
      <description>GPT Driver; {for-development:SDK-Manifest-ID: platform.drivers.gpt.MIMXRT1061X}</description>
      <files>
        <file category="sourceC" name="drivers/fsl_gpt.c"/>
        <file category="header" name="drivers/fsl_gpt.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="gpio" Cversion="2.0.5" condition="device.MIMXRT1061X_AND_driver.common">
      <description>GPIO Driver; {for-development:SDK-Manifest-ID: platform.drivers.igpio.MIMXRT1061X}</description>
      <files>
        <file category="header" name="drivers/fsl_gpio.h"/>
        <file category="sourceC" name="drivers/fsl_gpio.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="iomuxc" Cversion="2.0.1" condition="device.MIMXRT1061X_AND_driver.common">
      <description>IOMUXC Driver; {for-development:SDK-Manifest-ID: platform.drivers.iomuxc.MIMXRT1061X}</description>
      <files>
        <file category="header" name="drivers/fsl_iomuxc.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="kpp" Cversion="2.0.1" condition="device.MIMXRT1061X_AND_driver.common">
      <description>KPP Driver; {for-development:SDK-Manifest-ID: platform.drivers.kpp.MIMXRT1061X}</description>
      <files>
        <file category="header" name="drivers/fsl_kpp.h"/>
        <file category="sourceC" name="drivers/fsl_kpp.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="i2c" Cversion="2.3.1" condition="device.MIMXRT1061X_AND_driver.common">
      <description>LPI2C Driver; {for-development:SDK-Manifest-ID: platform.drivers.lpi2c.MIMXRT1061X}</description>
      <files>
        <file category="sourceC" name="drivers/fsl_lpi2c.c"/>
        <file category="header" name="drivers/fsl_lpi2c.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_edma" Cversion="2.3.0" condition="device.MIMXRT1061X_AND_driver.edma_AND_driver.lpi2c">
      <description>LPI2C Driver; {for-development:SDK-Manifest-ID: platform.drivers.lpi2c_edma.MIMXRT1061X}</description>
      <files>
        <file category="sourceC" name="drivers/fsl_lpi2c_edma.c"/>
        <file category="header" name="drivers/fsl_lpi2c_edma.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi" Cversion="2.2.1" condition="device.MIMXRT1061X_AND_driver.common">
      <description>LPSPI Driver; {for-development:SDK-Manifest-ID: platform.drivers.lpspi.MIMXRT1061X}</description>
      <files>
        <file category="sourceC" name="drivers/fsl_lpspi.c"/>
        <file category="header" name="drivers/fsl_lpspi.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi_edma" Cversion="2.0.5" condition="device.MIMXRT1061X_AND_driver.edma_AND_driver.lpspi">
      <description>LPSPI Driver; {for-development:SDK-Manifest-ID: platform.drivers.lpspi_edma.MIMXRT1061X}</description>
      <files>
        <file category="header" name="drivers/fsl_lpspi_edma.h"/>
        <file category="sourceC" name="drivers/fsl_lpspi_edma.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart" Cversion="2.5.2" condition="device.MIMXRT1061X_AND_driver.common">
      <description>LPUART Driver; {for-development:SDK-Manifest-ID: platform.drivers.lpuart.MIMXRT1061X}</description>
      <files>
        <file category="header" name="drivers/fsl_lpuart.h"/>
        <file category="sourceC" name="drivers/fsl_lpuart.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_edma" Cversion="2.5.2" condition="device.MIMXRT1061X_AND_driver.edma_AND_driver.lpuart">
      <description>LPUART Driver; {for-development:SDK-Manifest-ID: platform.drivers.lpuart_edma.MIMXRT1061X}</description>
      <files>
        <file category="header" name="drivers/fsl_lpuart_edma.h"/>
        <file category="sourceC" name="drivers/fsl_lpuart_edma.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="nic301" Cversion="2.0.0" condition="device.MIMXRT1061X_AND_driver.common">
      <description>NIC301 Driver; {for-development:SDK-Manifest-ID: platform.drivers.nic301.MIMXRT1061X}</description>
      <files>
        <file category="header" name="drivers/fsl_nic301.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ocotp" Cversion="2.1.3" condition="device.MIMXRT1061X_AND_driver.common">
      <description>OCOTP Driver; {for-development:SDK-Manifest-ID: platform.drivers.ocotp.MIMXRT1061X}</description>
      <files>
        <file category="header" name="drivers/fsl_ocotp.h"/>
        <file category="sourceC" name="drivers/fsl_ocotp.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pit" Cversion="2.0.4" condition="device.MIMXRT1061X_AND_driver.common">
      <description>PIT Driver; {for-development:SDK-Manifest-ID: platform.drivers.pit.MIMXRT1061X}</description>
      <files>
        <file category="sourceC" name="drivers/fsl_pit.c"/>
        <file category="header" name="drivers/fsl_pit.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pmu" Cversion="2.1.1" condition="device.MIMXRT1061X_AND_driver.common">
      <description>pmu Driver; {for-development:SDK-Manifest-ID: platform.drivers.pmu.MIMXRT1061X}</description>
      <files>
        <file category="header" name="drivers/fsl_pmu.h"/>
        <file category="sourceC" name="drivers/fsl_pmu.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pwm" Cversion="2.2.1" condition="device.MIMXRT1061X_AND_driver.common">
      <description>PWM Driver; {for-development:SDK-Manifest-ID: platform.drivers.pwm.MIMXRT1061X}</description>
      <files>
        <file category="sourceC" name="drivers/fsl_pwm.c"/>
        <file category="header" name="drivers/fsl_pwm.h"/>
      </files>
    </component>
