vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1061X_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="qtmr" Cversion="2.0.2" condition="device.MIMXRT1061X_AND_driver.common">
      <description>QTMR Driver; {for-development:SDK-Manifest-ID: platform.drivers.qtmr.MIMXRT1061X}</description>
      <files>
        <file category="sourceC" name="drivers/fsl_qtmr.c"/>
        <file category="header" name="drivers/fsl_qtmr.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="romapi" Cversion="1.0.1" condition="device.MIMXRT1061X_AND_driver.common">
      <description>ROMAPI Driver; {for-development:SDK-Manifest-ID: driver.romapi.MIMXRT1061X}</description>
      <files>
        <file category="header" name="drivers/fsl_romapi.h"/>
        <file category="sourceC" name="drivers/fsl_romapi.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="rtwdog" Cversion="2.1.2" condition="device.MIMXRT1061X_AND_driver.common">
      <description>RTWDOG Driver; {for-development:SDK-Manifest-ID: platform.drivers.rtwdog.MIMXRT1061X}</description>
      <files>
        <file category="header" name="drivers/fsl_rtwdog.h"/>
        <file category="sourceC" name="drivers/fsl_rtwdog.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sai" Cversion="2.3.4" condition="device.MIMXRT1061X_AND_driver.common">
      <description>SAI Driver; {for-development:SDK-Manifest-ID: platform.drivers.sai.MIMXRT1061X}</description>
      <files>
        <file category="header" name="drivers/fsl_sai.h"/>
        <file category="sourceC" name="drivers/fsl_sai.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sai_edma" Cversion="2.5.0" condition="device.MIMXRT1061X_AND_driver.edma_AND_driver.sai">
      <description>SAI EDMA Driver; {for-development:SDK-Manifest-ID: platform.drivers.sai_edma.MIMXRT1061X}</description>
      <files>
        <file category="header" name="drivers/fsl_sai_edma.h"/>
        <file category="sourceC" name="drivers/fsl_sai_edma.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="semc" Cversion="2.4.0" condition="device.MIMXRT1061X_AND_driver.common">
      <description>SEMC Driver; {for-development:SDK-Manifest-ID: platform.drivers.semc.MIMXRT1061X}</description>
      <files>
        <file category="header" name="drivers/fsl_semc.h"/>
        <file category="sourceC" name="drivers/fsl_semc.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="snvs_hp" Cversion="2.3.1" condition="device.MIMXRT1061X_AND_driver.common">
      <description>SNVS HP Driver; {for-development:SDK-Manifest-ID: platform.drivers.snvs_hp.MIMXRT1061X}</description>
      <files>
        <file category="sourceC" name="drivers/fsl_snvs_hp.c"/>
        <file category="header" name="drivers/fsl_snvs_hp.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="snvs_lp" Cversion="2.4.3" condition="device.MIMXRT1061X_AND_driver.common">
      <description>SNVS LP Driver; {for-development:SDK-Manifest-ID: platform.drivers.snvs_lp.MIMXRT1061X}</description>
      <files>
        <file category="sourceC" name="drivers/fsl_snvs_lp.c"/>
        <file category="header" name="drivers/fsl_snvs_lp.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="soc_flexram_allocate" Cversion="2.0.2" condition="device.MIMXRT1061X_AND_driver.common">
      <description>SOC FLEXRAM ALLOCATE Driver; {for-development:SDK-Manifest-ID: driver.soc_flexram_allocate.MIMXRT1061X}</description>
      <files>
        <file category="sourceC" name="drivers/fsl_flexram_allocate.c"/>
        <file category="header" name="drivers/fsl_flexram_allocate.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="spdif" Cversion="2.0.6" condition="device.MIMXRT1061X_AND_driver.common">
      <description>SPDIF Driver; {for-development:SDK-Manifest-ID: platform.drivers.spdif.MIMXRT1061X}</description>
      <files>
        <file category="header" name="drivers/fsl_spdif.h"/>
        <file category="sourceC" name="drivers/fsl_spdif.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="spdif_edma" Cversion="2.0.5" condition="device.MIMXRT1061X_AND_driver.edma_AND_driver.spdif">
      <description>SPDIF EDMA Driver; {for-development:SDK-Manifest-ID: platform.drivers.spdif_edma.MIMXRT1061X}</description>
      <files>
        <file category="header" name="drivers/fsl_spdif_edma.h"/>
        <file category="sourceC" name="drivers/fsl_spdif_edma.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="src" Cversion="2.0.1" condition="device.MIMXRT1061X_AND_driver.common">
      <description>SRC Driver; {for-development:SDK-Manifest-ID: platform.drivers.src.MIMXRT1061X}</description>
      <files>
        <file category="sourceC" name="drivers/fsl_src.c"/>
        <file category="header" name="drivers/fsl_src.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="tempmon" Cversion="2.1.1" condition="device.MIMXRT1061X_AND_driver.common">
      <description>TEMPMON Driver; {for-development:SDK-Manifest-ID: platform.drivers.tempmon.MIMXRT1061X}</description>
      <files>
        <file category="header" name="drivers/fsl_tempmon.h"/>
        <file category="sourceC" name="drivers/fsl_tempmon.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="trng" Cversion="2.0.12" condition="device.MIMXRT1061X_AND_driver.common">
      <description>TRNG Driver; {for-development:SDK-Manifest-ID: platform.drivers.trng.MIMXRT1061X}</description>
      <files>
        <file category="sourceC" name="drivers/fsl_trng.c"/>
        <file category="header" name="drivers/fsl_trng.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="tsc" Cversion="2.0.3" condition="device.MIMXRT1061X_AND_driver.common">
      <description>TSC Driver; {for-development:SDK-Manifest-ID: platform.drivers.tsc.MIMXRT1061X}</description>
      <files>
        <file category="sourceC" name="drivers/fsl_tsc.c"/>
        <file category="header" name="drivers/fsl_tsc.h"/>
      </files>
    </component>
